////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность", конфигурация "Учет обращений".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму списка обращения.
Процедура ОткрытьФормуСпискаОбращенияПриНачалеРаботыСистемы() Экспорт
	
	КлючеваяОперация = "ДокументыОткрытиеФормыФормаСписка";
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	
	ПараметрыОткрытия = Новый Структура("ПриНачалеРаботыСистемы", Истина);
	ОткрытьФорму("Справочник.Обращения.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти