////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Можно ли занять данный файл.
//
// Параметры:
//  ДанныеФайла    - Структура - с данными файла.
//  ОписаниеОшибки - Строка - содержащая текст ошибки в случае невозможности занять.
//                   Если не пустая, тогда файл невозможно занять.
//
Процедура ПриПопыткеЗанятьФайл(ДанныеФайла, ОписаниеОшибки = "") Экспорт
	
	
	
КонецПроцедуры

// Вызывается при создании файла.
//
// Параметры:
//  Файл - СправочникСсылка.Файлы - ссылка на созданный файл.
//
Процедура ПриСозданииФайла(Файл) Экспорт
	
КонецПроцедуры

// Вызывается после копирования файла из исходного файла для заполнения таких реквизитов нового файла,
// которые не предусмотрены в БСП и были добавлены к справочнику Файлы или ВерсииФайлов в конфигурации.
//
// Параметры:
//  НовыйФайл    - СправочникСсылка.Файлы - ссылка на новый файл, который надо заполнить.
//  ИсходныйФайл - СправочникСсылка.Файлы - ссылка на исходный файл, откуда надо скопировать реквизиты.
//
Процедура ЗаполнитьРеквизитыФайлаИзИсходногоФайла(НовыйФайл, ИсходныйФайл) Экспорт
	
КонецПроцедуры

// Вызывается при захвате файла.
//
// Параметры:
//  ДанныеФайла - Структура - содержащая сведения о файле
//                см. функцию РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла().
//
//  УникальныйИдентификатор - уникальный идентификатор формы.
//
Процедура ПриЗахватеФайла(ДанныеФайла, УникальныйИдентификатор) Экспорт
	
КонецПроцедуры

// Вызывается при освобождении файла.
//
// Параметры:
//  ДанныеФайла - Структура - содержащая сведения о файле
//                см. функцию РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла().
//
//  УникальныйИдентификатор - уникальный идентификатор формы.
//
Процедура ПриОсвобожденииФайла(ДанныеФайла, УникальныйИдентификатор) Экспорт
	
КонецПроцедуры

// Формирует массив метаданных, которые не должны выводиться в настройках очистки файлов.
//
// Возвращаемое значение:
//   Массив   - массив, содержащий метаданные, которые не должны выводиться в настройках очистки файлов.
//
Функция ОбъектыИсключенияПриОчисткеФайлов() Экспорт
	
	Массив = Новый Массив;
	
	Возврат Массив;
	
КонецФункции

// Формирует массив метаданных, которые не должны выводиться в настройках синхронизации файлов.
//
// Возвращаемое значение:
//   Массив   - массив, содержащий метаданные, которые не должны выводиться в настройках синхронизации файлов.
//
Функция ПриОпределенииОбъектовИсключенияСинхронизацииФайлов() Экспорт
	
	Массив = Новый Массив;
	
	Возврат Массив;
	
КонецФункции

// Можно ли удалить данный файл.
//
// Параметры:
//  ФайлОбъект - СправочникОбъект.Файлы
//  СтрокаОшибки - Строка
//
// Возвращаемое значение:
//  Булево. Возвращает всегда Истина для роли ПолныеПрава.
//
Функция ВозможноУдалитьФайл(ФайлОбъект, СтрокаОшибки = "") Экспорт 
	
	Возврат Истина;
	
КонецФункции

// Функция ПометкаУдаленияРазрешена, при использовании ограничения
// пометки удаления проверяет, разрешена ли текущему пользователю
// пометка удаления папки файлов или файла.
// 
// Параметры:
//  Ссылка       - СправочникСсылка.ПапкиФайлов, СправочникСсылка.Файлы,
//                 <ссылка на владельца>.
//
// Возвращаемое значение:
//  Булево.
//
Функция ПометкаУдаленияРазрешена(Ссылка) Экспорт
	
	// Проверка права на установку пометки удаления
	Возврат Истина;
	
КонецФункции

#КонецОбласти

