
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОрганДляПередачи = Параметры.ОрганДляПередачи;
	ИсходящаяДатаДокумента = Параметры.ИсходящаяДатаДокумента;
	ИсходящийНомерДокумента = Параметры.ИсходящийНомерДокумента;
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимПеренаправлено") И Параметры.РежимПеренаправлено Тогда 
		Элементы.ОрганДляПередачи.Подсказка = НСтр("ru = 'Орган/Учреждение, перенаправившее нам обращение'");
		Элементы.ОрганДляПередачи.ПодсказкаВвода = НСтр("ru = 'Орган/Учреждение, перенаправившее нам обращение'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ОрганДляПередачи", ОрганДляПередачи);
	ПараметрыЗакрытия.Вставить("ИсходящаяДатаДокумента", ИсходящаяДатаДокумента);
	ПараметрыЗакрытия.Вставить("ИсходящийНомерДокумента", ИсходящийНомерДокумента);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
