#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПроблемныйОбъект Из Параметры.ПроблемныеОбъекты Цикл
		ЗаполнитьЗначенияСвойств(ПроблемныеОбъекты.Добавить(), ПроблемныйОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПроблемныеОбъекты

&НаКлиенте
Процедура ПроблемныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элементы.ПроблемныеОбъекты.ТекущиеДанные.Объект);
	
КонецПроцедуры

#КонецОбласти