#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Справочники.ОрганыИУчреждения.НашеУчреждение Тогда
		Элементы.ЭтоГосОрган.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоГосОрган = Объект.ОрганУчреждение = Перечисления.ОрганУчреждение.Орган;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроходитАПК = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоГосОрган Тогда
		ТекущийОбъект.ОрганУчреждение = Перечисления.ОрганУчреждение.Орган;
	Иначе
		ТекущийОбъект.ОрганУчреждение = Перечисления.ОрганУчреждение.Учреждение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
