// Возвращает параметры начала работы
Функция НачалоРаботы() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("НуженПерезапуск", Ложь);
	
	Если ПользователиУчетОбращений.ПользователейНет() Тогда
		Результат.НуженПерезапуск = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Результат.Вставить("ПомощникНачалаРаботыЗапускался", Константы.ПомощникНачалаРаботыЗапускался.Получить());
		Результат.Вставить("ОбновитьКлассификатор", Константы.АктуализироватьКлассификатор.Получить());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции