#Область ПрограммныйИнтерфейс

Функция УзелВыгруженныеФайлы() Экспорт
	
	Возврат ПланыОбмена.ВыгрузкаВССТУ.НайтиПоКоду("02");
	
КонецФункции

Процедура НастроитьУзлы() Экспорт
	
	УзелОбъект = ПланыОбмена.ВыгрузкаВССТУ.ЭтотУзел().ПолучитьОбъект();
	Если УзелОбъект.Код <> "00" Тогда
		УзелОбъект.Код = "00";
		УзелОбъект.Наименование = НСтр("ru = 'Этот узел'");
		УзелОбъект.Записать();
	КонецЕсли;
	
	Узел = УзелВыгруженныеФайлы();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		УзелОбъект = ПланыОбмена.ВыгрузкаВССТУ.СоздатьУзел();
		УзелОбъект.Код = "02";
		УзелОбъект.Наименование = НСтр("ru = 'Выгруженные файлы'");
		УзелОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти