////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с сообщениями.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет проверку необходимости отправки сообщения по почте.
//
// Параметры:
//  Сообщение - СправочникОбъект.Сообщение, ДанныеФормыКоллекция - Сообщение, для которого выполняется проверка.
//
// Возвращаемое значение:
//  Булево - Требуется отправить сообщение.
//
Функция ТребуетсяОтправитьСообщение(Сообщение) Экспорт
	
	Возврат Не ЗначениеЗаполнено(Сообщение.ДатаОтправкиПоПочте);
	
КонецФункции

#КонецОбласти