#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НашеУчреждение = ПредопределенноеЗначение("Справочник.ОрганыИУчреждения.НашеУчреждение");
	
	ПараметрыФормы = Новый Структура("Ключ", НашеУчреждение);
	ОткрытьФорму("Справочник.ОрганыИУчреждения.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти