
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьНедействительных = Ложь;
	ПоказатьНедействительных();
	Элементы.ФормаПереключитьПоказНедействительных.Пометка = ПоказыватьНедействительных;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаСоздать.Видимость = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьНедействительных()

	
	Если ПоказыватьНедействительных Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "Недействителен");		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "ПометкаУдаления");		
			
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Недействителен", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ПометкаУдаления", Ложь);
			
	КонецЕсли;
		
КонецПроцедуры		

&НаСервере
Процедура ПереключитьПоказНедействительныхНаСервере()
	
	ПоказыватьНедействительных = Не ПоказыватьНедействительных;
	ПоказатьНедействительных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьПоказНедействительных(Команда)
	
	ПереключитьПоказНедействительныхНаСервере();
	Элементы.ФормаПереключитьПоказНедействительных.Пометка = ПоказыватьНедействительных;
	
КонецПроцедуры
