
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область НастройкиОтчетаПоУмолчанию

Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Подсистемы.СтандартныеПодсистемы));
		
	Если КлючВариантаОтчета = "СписокОбращений" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	ИначеЕсли КлючВариантаОтчета = "ВидОбращения" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	ИначеЕсли КлючВариантаОтчета = "ДинамикаКоличестваОбращений" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	ИначеЕсли КлючВариантаОтчета = "ОбращенияСИстекающимСрокомДействия" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли