#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Заголовок = ТекущийОбъект;
	ТекстHTML = ТекущийОбъект.ТекстПросмотра();
	
	Элементы.ПредметСсылкой.Видимость = ЗначениеЗаполнено(ТекущийОбъект.Предмет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаС_HTMLКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element);
	
КонецПроцедуры

#КонецОбласти