&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбрано ни одного документа или файла!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыОтправкиПочтовогоСообщенияПовтИсп.ЕстьДоступныеПрофилиПочты() Тогда
		// тут предлагаем настроить
		
		ПараметрыВыполнения = Новый Структура("ПараметрКоманды", ПараметрКоманды);
		Обработчик = Новый ОписаниеОповещения("ВыполнитьОтправкуПослеПроверки", 
			ЭтотОбъект, ПараметрыВыполнения);
			
		ДляОтправки = Истина;
		ЛегкаяПочтаКлиент.НастроитьПочтуИВыполнить(Обработчик, ПараметрКоманды, ДляОтправки);
		
		Возврат;
		
	КонецЕсли;	
	
	ВыполнитьОтправкуПослеПроверки(ПараметрКоманды, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправкуПослеПроверки(ПараметрКоманды, ДополнительныеПараметры) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Объекты", ПараметрКоманды);
	ОткрытьФорму(
		"Обработка.ПочтовоеСообщение.Форма.Форма",
		ПараметрыОткрытия,,
		Новый УникальныйИдентификатор);
	
КонецПроцедуры
