
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстПредупреждения") И ЗначениеЗаполнено(Параметры.ТекстПредупреждения) Тогда 
		Элементы.Предупреждение.Заголовок = Параметры.ТекстПредупреждения;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючОбъекта") И ЗначениеЗаполнено(Параметры.КлючОбъекта) Тогда 
		КлючОбъекта = Параметры.КлючОбъекта;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючНастроек") И ЗначениеЗаполнено(Параметры.КлючНастроек) Тогда 
		КлючНастроек = Параметры.КлючНастроек;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Если БольшеНеСпрашивать Тогда
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(КлючОбъекта,
			КлючНастроек, Ложь);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры
