#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоБазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	Если ЭтоБазоваяВерсия Тогда
		Элементы.СправочникПользователиОткрытьСписок.Видимость = Ложь;
	Иначе	
		Элементы.Пользователь.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаОтправкиСообщений(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимНастройкиДляОбычногоПользователя", Ложь);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.НастройкаОтправкиСообщений",
		ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияНаСайтеИнтернетПоддержкиПользователей(Команда)
	
	СтандартныеПодсистемыКлиент.АвторизоватьНаСайтеПоддержкиПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудник(Команда)
	
	ПоказатьЗначение(,ПользователиКлиентСервер.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройки(Команда)
	
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.ОбщиеНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНумерации(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиНумерации.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СрокиРассмотренияОбращений(Команда)
	
	ОткрытьФорму("Справочник.СрокиРассмотренияОбращений.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти