
#Область Программый_интерфейс

Функция ПолучитьЭлементКлассификатора(ТипЭлемента, КодЭлемента) Экспорт
	
	Возврат ПодборИзКлассификатораОбращенийГражданСервер.ПолучитьЭлементКлассификатора(ТипЭлемента, КодЭлемента);
	
КонецФункции

Функция ВопросКорректен(Раздел, Тематика, Тема, Вопрос, ТекстОшибки) Экспорт
	
	РазделТематики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тематика, "Раздел");
	Если ЗначениеЗаполнено(РазделТематики) И РазделТематики <> Раздел Тогда 
		ТекстОшибки = Нстр("ru = 'Некорректный код вопроса: Тематика вопроса не соответствует разделу.'");
		Возврат Ложь;
	КонецЕсли;
	
	ТематикаТемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Тематика");
	Если ЗначениеЗаполнено(ТематикаТемы) И ТематикаТемы <> Тематика Тогда 
		ТекстОшибки = Нстр("ru = 'Некорректный код вопроса: Тема вопроса не соответствует тематике.'");
		Возврат Ложь;
	КонецЕсли;
	
	ТемаВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вопрос, "Тема");
	Если ЗначениеЗаполнено(ТемаВопроса) И ТемаВопроса <> Тема Тогда 
		ТекстОшибки = Нстр("ru = 'Некорректный код вопроса: Вопрос не соответствует теме.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Служебные_процедуры_и_функции

#КонецОбласти
