
Функция ПолучитьПараметрыНумерации(Объект) Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЧисловойНомер", 	Объект.ЧисловойНомер);
	СтруктураПараметров.Вставить("ДатаДокумента", 	Объект.ДатаДокумента);
	СтруктураПараметров.Вставить("ВидОбращения", 	Объект.ВидОбращения);
	СтруктураПараметров.Вставить("Ответственный", 	Объект.Ответственный);
	СтруктураПараметров.Вставить("Ссылка", 			Объект.Ссылка);
	СтруктураПараметров.Вставить("СвязанныйДокумент", ПредопределенноеЗначение("Справочник.Обращения.ПустаяСсылка"));
	Возврат СтруктураПараметров;
	
КонецФункции
